@DRuggeri  yes the`data` attribute contains everything that will be sent and managed by the API client. I don't change this. 

If we declare the parameters `data_md5hash`, we only store the hash of the content in the tfstate.

My use case is to push an new grafana dashboard with the api data json (my payload contain the big dashoard json definition).

I don't want to keep the dashoard json definition in the tfstate.
However, in case of update I have to compare if something change, that is why I choose the md5 hash method. For this I just use the **StateFunc** recommanded by Terraform

https://www.terraform.io/docs/extend/schemas/schema-methods.html
```
// StateFunc is a function called to change the value of this before
// storing it in the state (and likewise before comparing for diffs).
// The use for this is for example with large strings, you may want
// to simply store the hash of it.
Computed  bool
ForceNew  bool
StateFunc SchemaStateFunc
```

### Example of grafana dashboard using data_md5hash

**TF resource definition**

```
resource "restapi_object" "dashboard" {
  path         = "/api/dashboards/db"
  read_path    = "/api/dashboards/uid/{id}"
  update_path  = "/api/dashboards/db"
  update_method = "POST"
  update_api_data = false
  destroy_path = "/api/dashboards/uid/{id}"
  id_attribute = "uid"
  data_md5hash = jsonencode({
    "dashboard": {"title":"My dahsboard","uid":"cQHrs2mGk","version":2,"panels":[{"collapsed":false,"datasource":null,"gridPos":{"h":1,"w":24,"x":0,"y":0},"id":6,"panels":[],"title":"Overview","type":"row"}]}
    "overwrite": var.overwrite
    "folderId": var.folder_id
    "message": "update from terraform"
  })
}
```
**TF plan**
```
+ resource "restapi_object" "dashboard" {
    + api_data        = (known after apply)
    + api_response    = (known after apply)
    + create_response = (known after apply)
    + data_md5hash    = jsonencode(
          {
            + value = "0999c29adf5b8de2f002133f7b097b6e"
          }
      )
    + destroy_path    = "/api/dashboards/uid/{id}"
    + id              = (known after apply)
    + id_attribute    = "uid"
    + path            = "/api/dashboards/db"
    + read_path       = "/api/dashboards/uid/{id}"
    + update_api_data = false
    + update_method   = "POST"
    + update_path     = "/api/dashboards/db"
  }
```